bookers2/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      flash[:success] = "You have created book successfully"
      redirect_to book_path(@book)
    else
      @user = current_user
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "a"], ["body", "aa"], ["user_id", 1], ["created_at", "2021-08-18 12:42:47.357367"], ["updated_at", "2021-08-18 12:42:47.357367"]]
SELECT "books".* FROM "books"

  def index
    @user = current_user
    @book = Book.new
    @books = Book.all
---
SELECT "books".* FROM "books"

  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "bfda"], ["updated_at", "2021-08-21 17:13:24.851765"], ["id", 27]]