bookers2/app/controllers/users_controller.rb

SELECT "books".* FROM "books"
SELECT "users".* FROM "users"
---
  def index
    @user = current_user
    @books = Book.all
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @book = Book.new
    @books = Book.where(user_id: @user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "ef0025ca3fc12956e7bd0daf864e2c8c8af55f9bc22a756db852851d766b"], ["introduction", "aaaaa"], ["updated_at", "2021-08-19 06:11:28.475545"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
      flash[:notice] = "You have updated user successfully"
      redirect_to user_path(current_user)
    else
      @user = User.find(user_params)